In [1]:
import pandas as pd

In [148]:
#Load the user dataset
df_user = pd.read_csv('takehome_users.csv', encoding='latin-1')
df_user.head()

,object_id,creation_time,name,email,creation_source,last_session_creation_time,opted_in_to_mailing_list,enabled_for_marketing_drip,org_id,invited_by_user_id
0,1,2014-04-22 03:53:30,Clausen August,AugustCClausen@yahoo.com,GUEST_INVITE,1.398139e+09,1,0,11,10803.0
1,2,2013-11-15 03:45:04,Poole Matthew,MatthewPoole@gustr.com,ORG_INVITE,1.396238e+09,0,0,1,316.0
2,3,2013-03-19 23:14:52,Bottrill Mitchell,MitchellBottrill@gustr.com,ORG_INVITE,1.363735e+09,0,0,94,1525.0
3,4,2013-05-21 08:09:28,Clausen Nicklas,NicklasSClausen@yahoo.com,GUEST_INVITE,1.369210e+09,0,0,1,5151.0
4,5,2013-01-17 10:14:20,Raw Grace,GraceRaw@yahoo.com,GUEST_INVITE,1.358850e+09,0,0,193,5240.0

In [149]:
#Load the login dataset
df_login = pd.read_csv('takehome_user_engagement.csv')
df_login.head()

            time_stamp  user_id  visited
0  2014-04-22 03:53:30        1        1
1  2013-11-15 03:45:04        2        1
2  2013-11-29 03:45:04        2        1
3  2013-12-09 03:45:04        2        1
4  2013-12-25 03:45:04        2        1

In [150]:
df_login.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 207917 entries, 0 to 207916
Data columns (total 3 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   time_stamp  207917 non-null  object
 1   user_id     207917 non-null  int64
 2   visited     207917 non-null  int64
dtypes: int64(2), object(1)
memory usage: 4.8+ MB

Let's convert the time_stamp column to datetime object and set it as the index of the dataframe

In [151]:
df_login['time_stamp'] = pd.to_datetime(df_login['time_stamp'])
df_login['date'] = df_login['time_stamp'].dt.date
df = df_login.drop('time_stamp', axis=1)
df_login.set_index('time_stamp', inplace=True)
df_login.head()

                     user_id  visited        date
time_stamp
2014-04-22 03:53:30        1        1  2014-04-22
2013-11-15 03:45:04        2        1  2013-11-15
2013-11-29 03:45:04        2        1  2013-11-29
2013-12-09 03:45:04        2        1  2013-12-09
2013-12-25 03:45:04        2        1  2013-12-25

In [158]:
df_login.reset_index().groupby('user_id')['date'].rolling(window=3)

RollingGroupby [window=3,center=False,axis=0]

In [175]:
df1 = pd.DataFrame(df.groupby(['date','user_id'], group_keys=False)['visited'].agg(sum))

In [176]:
df1

                    visited
date       user_id
2012-05-31 1693           1
           3428           1
           9899           1
           10012          1
2012-06-01 1995           1
...                     ...
2014-06-04 11885          1
           11895          1
           11906          1
           11924          1
2014-06-06 4051           1

[207917 rows x 1 columns]

In [171]:
df1.reset_index().nunique()

date        736
user_id    8823
visited       1
dtype: int64

In [126]:
df = df_login.groupby('user_id').resample('D').sum()

In [127]:
df

                    user_id  visited
user_id time_stamp
1       2014-04-22        1        1
2       2013-11-15        2        1
        2013-11-16        0        0
        2013-11-17        0        0
        2013-11-18        0        0
...                     ...      ...
11996   2013-09-06    11996        1
11997   2013-01-15    11997        1
11998   2014-04-27    11998        1
11999   2012-06-02    11999        1
12000   2014-01-26    12000        1

[522501 rows x 2 columns]

In [120]:
df.drop('user_id', axis=1, inplace=True)

In [107]:
df = df_login.groupby(['user_id']).resample('d')['visited'].sum()

In [108]:
df_login['user_id'].min()

1

In [ ]:
df.groupby(['user_id','date'])['Sales'].agg('count').reset_index()

In [103]:
pd.DataFrame(df_login['user_id'].value_counts()).query('user_id > 0')

       user_id
3623       606
906        600
1811       593
7590       590
8068       585
...        ...
6763         1
3773         1
5822         1
10040        1
2047         1

[8823 rows x 1 columns]

In [89]:
df_login.query('user_id == 11996')

                     user_id  visited
time_stamp
2013-09-06 06:14:15    11996        1

In [78]:
# df = df.reset_index(level=0).drop('level_0', axis=1)
df.reset_index().sorted(by='time_stamp')

AttributeError: 'DataFrame' object has no attribute 'sorted'

In [43]:
df_login.groupby(['date','user_id']).count()

                    visited
date       user_id
2012-05-31 1693           1
           3428           1
           9899           1
           10012          1
2012-06-01 1995           1
...                     ...
2014-06-04 11885          1
           11895          1
           11906          1
           11924          1
2014-06-06 4051           1

[207917 rows x 1 columns]

In [40]:
df.reset_index(level=1).groupby('user_id').sum().visited.max()

606

In [21]:
df_login.user_id.max()

12000

In [22]:
df_login.groupby(['user_id']).sum()

         visited
user_id
1              1
2             14
3              1
4              1
5              1
...          ...
11996          1
11997          1
11998          1
11999          1
12000          1

[8823 rows x 1 columns]

We need the visited column as 1 at each row. Let's if this is the case.

In [18]:
df_login['visited'] .describe()

count    207917.0
mean          1.0
std           0.0
min           1.0
25%           1.0
50%           1.0
75%           1.0
max           1.0
Name: visited, dtype: float64

In [20]:
df_login.head()

                     user_id  visited
time_stamp
2014-04-22 03:53:30        1        1
2013-11-15 03:45:04        2        1
2013-11-29 03:45:04        2        1
2013-12-09 03:45:04        2        1
2013-12-25 03:45:04        2        1

We want to calculate the number of logins in 7-day rolling windows and find the user who have logined at least 3 times in at least one 7-day window. Thus we will aggregate the df_login to count the daily logins (alternatively resample the df_login accordingly), then we will group by user id. This way we will obtain daily

In [27]:
df_login.groupby(by='user_id').sum()

      user_id  visited
0           1        1
1           2       14
2           3        1
3           4        1
4           5        1
...       ...      ...
8818    11996        1
8819    11997        1
8820    11998        1
8821    11999        1
8822    12000        1

[8823 rows x 2 columns]

In [33]:
df_login.index.dt.date

AttributeError: 'DatetimeIndex' object has no attribute 'dt'